uTasker/uTasker-Kinetis/Hardware/Kinetis/kinetis_boot.c
/**********************************************************************
    Mark Butcher    Bsc (Hons) MPhil MIET

    M.J.Butcher Consulting
    Birchstrasse 20f,    CH-5406, R�tihof
    Switzerland

    www.uTasker.com    Skype: M_J_Butcher

    ---------------------------------------------------------------------
    File:      kinetis_boot.c
    Project:   Single Chip Embedded Internet - boot loader
    ---------------------------------------------------------------------
    Copyright (C) M.J.Butcher Consulting 2004..2021
    *********************************************************************
    17.04.2012 Add start_application() and flash support for KINETIS_K_FPU types {1}
    25.08.2013 Allow user defined start-up code immediately after the watchdog configuration and before clock configuration to be defined {2}
    18.06.2014 Implement fnFlashRoutine() as assemble code to avoid possibility of compilers in-lining it {3}
    27.01.2015 Add Green Hills project support (_COMPILE_GHS)            {4}
    06.01.2021 Add start_application() for Cortex-M0+ cores              {5}

    */

#ifdef _KINETIS

#ifdef _WINDOWS
    #include "config.h"
    #define INITHW  extern
    extern void fnOpenDefaultHostAdapter(void);
    extern void fec_txf_isr(void);
    extern void fnSimulateDMA(int channel);
    #define START_CODE 0
#else
    #define OPSYS_CONFIG                                                 // this module owns the operating system configuration
    #define INITHW  static
    #include "config.h"
    #define  fnSimulateDMA(x)
    #if defined ROWLEY || defined _KDS
        #define asm(x) __asm__(x)
    #endif
    #if defined _COMPILE_KEIL
        #define START_CODE main
    #elif defined _COMPILE_IAR
        #define START_CODE disable_watchdog
    #elif defined _COMPILE_GHS                                           // {4}
        extern void _start_T(void);                                      // GHS library initialisation routine
        #define START_CODE disable_watchdog
    #else
        #define START_CODE main
    #endif
#endif

#ifdef SPI_SW_UPLOAD
    #define SPI_FLASH_DEVICE_COUNT 1
    static int SPI_FLASH_Danger[SPI_FLASH_DEVICE_COUNT] = {0};           // signal that the FLASH status should be checked before using since there is a danger that it is still busy
    static unsigned char ucSPI_FLASH_Type[SPI_FLASH_DEVICE_COUNT];
    #define _EXTENDED_CS
#endif
static unsigned long ulFlashRow[FLASH_ROW_SIZE/sizeof(unsigned long)];   // FLASH row backup buffer (on word boundary)


#if defined _COMPILE_IAR || defined _COMPILE_GHS                         // {4}
extern void __iar_program_start(void);                                   // IAR library initialisation routine
// This is the first function called so that it can immediately disable the watchdog so that it doesn't fire during variable initialisation
//
static void disable_watchdog(void)
{
    UNLOCK_WDOG();                                                       // enable watchdog modification
    CONFIGURE_WATCHDOG();                                                // allow user configuration of internal watch dog timer
    #if defined USER_STARTUP_CODE                                        // {2} allow user defined start-up code immediately after the watchdog configuration and before clock configuration to be defined
    USER_STARTUP_CODE;
    #endif
    #if defined _COMPILE_GHS                                             // {4}
    _start_T();                                                          // now call the GHS initialisation code which initialises variables and then calls main() 
    #else
    __iar_program_start();                                               // now call the IAR initialisation code which initialises variables and then calls main() 
    #endif
}
#endif


// CRC-16 routine
//
extern unsigned short fnCRC16(unsigned short usCRC, unsigned char *ptrInput, unsigned short usBlockSize)
{
    while (usBlockSize--) {
        usCRC = (unsigned char)(usCRC >> 8) | (usCRC << 8);
        usCRC ^= *ptrInput++;
        usCRC ^= (unsigned char)(usCRC & 0xff) >> 4;
        usCRC ^= (usCRC << 8) << 4;
        usCRC ^= ((usCRC & 0xff) << 4) << 1;
    }
    return usCRC;
}

extern void fnDelayLoop(unsigned long ulDelay_us)
{
    volatile int i_us;
    while (ulDelay_us--) {                                               // for each us required
        i_us = (CORE_CLOCK/8300000);
        while (i_us--) {}                                                // simple loop tuned to perform us timing
    }
}

// memset implementation
//
extern void *uMemset(void *ptrTo, int iValue, size_t Size)
{
    void *buffer = ptrTo;
    unsigned char *ptr = (unsigned char *)ptrTo;
    unsigned char ucValue = (unsigned char)iValue;

    while (Size--) {
        *ptr++ = ucValue;
    }

    return buffer;
}

// memcpy implementation
//
extern void *uMemcpy(void *ptrTo, const void *ptrFrom, size_t Size)
{
    void *buffer = ptrTo;
    unsigned char *ptr1 = (unsigned char *)ptrTo;
    unsigned char *ptr2 = (unsigned char *)ptrFrom;

    while (Size--) {
        *ptr1++ = *ptr2++;
    }

    return buffer;
}

// This routine runs from SRAM - the reason why the pointer is passed is to avoid the routine taking it from a const value in FLASH, which is then not code location independent
//
    #if defined _WINDOWS
#define PROG_WORD_SIZE 30                                                // adequate space for the small program
static void fnFlashRoutine(volatile unsigned char *ptrFTFL_BLOCK)
{
    *ptrFTFL_BLOCK = FTFL_STAT_CCIF;                                     // launch the command - this clears the FTFL_STAT_CCIF flag (register is FTFL_FSTAT)
    while (!(*ptrFTFL_BLOCK & FTFL_STAT_CCIF)) {}                        // wait for the command to terminate
}
    #else                                                                // {3}
#define PROG_WORD_SIZE 6                                                 // exact size of the small program
static unsigned short fnFlashRoutine[] = {                               // to avoid potential compiler in-lining of the routine (removing position independency) the machine code is used directly
    0x2180,    // MOVS   r1,#0x80                                           load the value 0x80 (command complete interrupt flag) to register r1
    0x7001,    // STRB   r1,[r0,#0x00]                                      write r1 (0x80) to the passed pointer location (r0)
    0x7801,    // LDRB   r1,[r0,#0x00]                                      read back from the same location to r1
    0x0609,    // LSLS   r1,r1,#24                                          shift the register content by 24 bits to the left so that the command complete interrupt flag is at bit 31
    0xd5fc,    // BPL    -4                                                 if the command complete interrupt flag bit is '0' (register content is not negative value) branch back to read its value again
    0x4770     // BX     lr                                                 return from sub-routine
};
    #endif
static int fnFlashNow(unsigned char ucCommand, unsigned long *ptrWord, unsigned long *ptr_ulWord)
{
    static void (*fnRAM_code)(volatile unsigned char *) = 0;
    if (!fnRAM_code) {                                                   // the first time this is used it will load the program to SRAM
        int i = 0;
        unsigned char *ptrThumb2 = (unsigned char *)fnFlashRoutine;
        static unsigned short usProgSpace[PROG_WORD_SIZE];               // make space for the routine on stack (this will have an even boundary)

        ptrThumb2 =  (unsigned char *)(((CAST_POINTER_ARITHMETIC)ptrThumb2) & ~0x1); // thumb 2 address
        while (i < PROG_WORD_SIZE) {                                     // copy program to SRAM
            usProgSpace[i++] = *(unsigned short *)ptrThumb2;
            ptrThumb2 += sizeof (unsigned short);
        }
        ptrThumb2 = (unsigned char *)usProgSpace;
        ptrThumb2++;                                                     // create a thumb 2 call
        fnRAM_code = (void(*)(volatile unsigned char *))(ptrThumb2);
    }
    while (!(FTFL_FSTAT & FTFL_STAT_CCIF)) {}                            // wait for previous commands to complete

    if (FTFL_FSTAT & (FTFL_STAT_ACCERR | FTFL_STAT_FPVIOL)) {            // check for errors in previous command 
        FTFL_FSTAT = (FTFL_STAT_ACCERR | FTFL_STAT_FPVIOL);              // clear old errors
    }
     
    switch (FTFL_FCCOB0 = ucCommand) {                                   // enter the command sequence
    case FCMD_ERASE_FLASH_SECTOR:
    case FCMD_PROGRAM:
        FTFL_FCCOB1 = (unsigned char)(((CAST_POINTER_ARITHMETIC)ptrWord) >> 16); // set address in flash
        FTFL_FCCOB2 = (unsigned char)(((CAST_POINTER_ARITHMETIC)ptrWord) >> 8);
        FTFL_FCCOB3 = (unsigned char)((CAST_POINTER_ARITHMETIC)ptrWord);
        if (ucCommand == FCMD_PROGRAM) {                                 // program long-word aligned value
            FTFL_FCCOB4 = (unsigned char)(*ptr_ulWord >> 24);            // enter the long word to be programmed
            FTFL_FCCOB5 = (unsigned char)(*ptr_ulWord >> 16);
            FTFL_FCCOB6 = (unsigned char)(*ptr_ulWord >> 8);
            FTFL_FCCOB7 = (unsigned char)(*ptr_ulWord);
    #ifdef _WINDOWS
            *(unsigned long *)fnGetFlashAdd((unsigned char *)ptrWord) = *ptr_ulWord;
    #endif
    #if defined KINETIS_K_FPU                                            // write second long word {1}
            ptr_ulWord++;
            FTFL_FCCOB8 = (unsigned char)(*ptr_ulWord >> 24);            // enter the second long word to be programmed
            FTFL_FCCOB9 = (unsigned char)(*ptr_ulWord >> 16);
            FTFL_FCCOBA = (unsigned char)(*ptr_ulWord >> 8);
            FTFL_FCCOBB = (unsigned char)(*ptr_ulWord);
    #endif
    #ifdef _WINDOWS
            *(unsigned long *)fnGetFlashAdd((unsigned char *)(ptrWord + 1)) = *ptr_ulWord;;
    #endif
        }
        else {
    #ifdef _WINDOWS
            fnDeleteFlashSector(fnGetFlashAdd((unsigned char *)ptrWord));// the sector erase must be phrase aligned ([2:0] = 0)
    #endif
        }
        break;
    }

#if defined _WINDOWS
    fnFlashRoutine((volatile unsigned char *)FTFL_BLOCK);
#else
    fnRAM_code((volatile unsigned char *)FTFL_BLOCK);                    // execute the command from SRAM
#endif

    return (FTFL_FSTAT & (FTFL_STAT_ACCERR | FTFL_STAT_FPVIOL | FTFL_STAT_MGSTAT0)); // if there was an error this will be non-zero
}

#ifdef SPI_SW_UPLOAD
    #ifdef SPI_FLASH_SST25
static unsigned char *fnGetSPI_FLASH_address(unsigned char *ucDestination)
{
    ucDestination -= (SPI_FLASH_START);                                  // location relative to the start of the SPI FLASH chip address
    return ucDestination;
}
    #else
// Return the page number and optionally the address offset in the page
//
static unsigned short fnGetSPI_FLASH_location(unsigned char *ptrSector, unsigned short *usPageOffset)
{
    unsigned short usPageNumber;
    ptrSector -= (SPI_FLASH_START);                                      // location relative to the start of the SPI FLASH chip address

    usPageNumber = (unsigned short)(((CAST_POINTER_ARITHMETIC)ptrSector)/SPI_FLASH_PAGE_LENGTH); // the page the address is in
    if (usPageOffset != 0) {
        *usPageOffset = (unsigned short)((CAST_POINTER_ARITHMETIC)ptrSector - (usPageNumber * SPI_FLASH_PAGE_LENGTH)); // offset in the page
    }
    return usPageNumber;
}
    #endif

    #define _SPI_FLASH_INTERFACE                                         // insert manufacturer dependent code
        #include "spi_flash_kinetis_atmel.h"
        #include "spi_flash_kinetis_stmicro.h"
        #include "spi_flash_kinetis_sst25.h"
    #undef _SPI_FLASH_INTERFACE

