uTasker/uTasker-Kinetis/Hardware/Kinetis/kinetis_boot.c
    ptrData = &__text_start__;
    ptrFlash = &__text_load_start__;
    if (ptrFlash != ptrData) {                                           // if a move is required
        ulInitDataLength = (&__text_end__ - &__text_start__);
        while (ulInitDataLength--) {                                     // initialise text
            *ptrData++ = *ptrFlash++;
        }
    }
    #endif
    ptrData = &__bss_start__;
    ulInitDataLength = (&__bss_end__ - &__bss_start__);
    while (ulInitDataLength--) {                                         // initialise bss
        *ptrData++ = 0;
    }
}
#endif

// Perform very low level initialisation - called by the start up code
//
#if defined _COMPILE_KEIL || defined _GNU || defined _CODE_WARRIOR
extern int
#else
extern void
#endif
#ifdef _WINDOWS
            _LowLevelInit(void)
#else
            main(void)
#endif
{
#ifndef _COMPILE_IAR
    CONFIGURE_WATCHDOG();                                                // allow user configuration of internal watch dog timer
    #if defined USER_STARTUP_CODE                                        // {2} allow user defined start-up code immediately after the watchdog configuration and before clock configuration to be defined
    USER_STARTUP_CODE;
    #endif
#endif
#ifdef EXTERNAL_CLOCK                                                    // first move from state FEI to state FBE (presently running from about 25MHz internal clock)
    MCG_C2 = (MCG_C2_RANGE_8M_32M);                                      // don't use oscillator
    MCG_C1 = (MCG_C1_CLKS_EXTERN_CLK | MCG_C1_FRDIV_1024);               // switch to external input clock (the FLL input clock is set to as close to its input range as possible, although this is not necessary since the FLL will not be used)
#else
    #if CRYSTAL_FREQUENCY > 8000000
    MCG_C2 = (MCG_C2_RANGE_8M_32M | MCG_C2_HGO | MCG_C2_EREFS);          // select crystal oscillator
    #elif CRYSTAL_FREQUENCY >= 1000000
    MCG_C2 = (MCG_C2_RANGE_1M_8M | MCG_C2_HGO | MCG_C2_EREFS);           // select crystal oscillator
    #else                                                                // assumed to be 32kHz crystal
    MCG_C2 = (MCG_C2_RANGE_32K_40K | MCG_C2_HGO | MCG_C2_EREFS);         // select crystal oscillator
    #endif
    MCG_C1 = (MCG_C1_CLKS_EXTERN_CLK | MCG_C1_FRDIV_256);                // switch to external source (the FLL input clock is set to as close to its input range as possible, although this is not absolutely necessary since the FLL will not be used) this is accurate for 8MHz clock but hasn't been tested for other values
    while (!(MCG_S & MCG_S_OSCINIT)) {                                   // loop until the crystal source has been selected
    #ifdef _WINDOWS
        MCG_S |= MCG_S_OSCINIT;
    #endif
    }
#endif
    while (MCG_S & MCG_S_IREFST) {                                       // loop until the FLL source is no longer the internal reference clock
#ifdef _WINDOWS
        MCG_S &= ~MCG_S_IREFST;
#endif
    }
    while ((MCG_S & MCG_S_CLKST_MASK) != MCG_S_CLKST_EXTERN_CLK) {       // loop until the external reference clock source is valid
#ifdef _WINDOWS
        MCG_S &= ~MCG_S_CLKST_MASK;
        MCG_S |= MCG_S_CLKST_EXTERN_CLK;
#endif
    }    
    MCG_C5 = (CLOCK_DIV - 1);                                            // now move from state FBE to state PBE
    MCG_C6 = ((CLOCK_MUL - 24) | MCG_C6_PLLS);
    while ((MCG_S & MCG_S_PLLST) == 0) {                                 // loop until the PLLS clock source becomes valid
#ifdef _WINDOWS
        MCG_S |= MCG_S_PLLST;
#endif
    }
    while ((MCG_S & MCG_S_LOCK) == 0) {                                  // loop until PLL locks
#ifdef _WINDOWS
        MCG_S |= MCG_S_LOCK;
#endif
    }
    SIM_CLKDIV1 = (((SYSTEM_CLOCK_DIVIDE - 1) << 28) | ((BUS_CLOCK_DIVIDE - 1) << 24) | ((FLEX_CLOCK_DIVIDE - 1) << 20) | ((FLASH_CLOCK_DIVIDE - 1) << 16)); // prepare bus clock divides
    MCG_C1 = (MCG_C1_CLKS_PLL_FLL | MCG_C1_FRDIV_1024);                  // finally move from PBE to PEE mode - switch to PLL clock
    while ((MCG_S & MCG_S_CLKST_MASK) != MCG_S_CLKST_PLL) {              // loop until the PLL clock is selected
#ifdef _WINDOWS
        MCG_S &= ~MCG_S_CLKST_MASK;
        MCG_S |= MCG_S_CLKST_PLL;
#endif
    }   

#if defined (_GNU) || defined _CODE_WARRIOR
    __init_gnu_data();                                                   // initialise variables
#elif defined _COMPILE_KEIL
    _keil_ram_size(1);                                                   // initialise variables
#endif
#ifdef _WINDOWS                                                          // check that the size of the interrupt vectors has not grown beyond that what is expected (increase its space in the script file if necessary!!)
    if (VECTOR_SIZE > CHECK_VECTOR_SIZE) {
        _EXCEPTION("Check the vector table size setting!!");
    }
#endif
#ifndef _WINDOWS
    uTaskerBoot();                                                       // call the boot loader
#endif
#if defined _COMPILE_KEIL || defined _GNU || defined _CODE_WARRIOR
    return 0;
#endif
}


// The initial stack pointer and PC value - this is linked at address 0x00000000
//
#if defined _COMPILE_IAR
__root const RESET_VECTOR __vector_table @ ".intvec"                     // __root forces the function to be linked in IAR project
#elif defined _GNU
const RESET_VECTOR __attribute__((section(".vectors"))) reset_vect
#elif defined _CODE_WARRIOR
#pragma define_section vectortable ".RESET" ".RESET" ".RESET" far_abs R
static __declspec(vectortable) RESET_VECTOR __vect_table
#elif defined _COMPILE_KEIL
__attribute__((section("VECT"))) const RESET_VECTOR reset_vect
#else
    #if defined _COMPILE_GHS                                             // {4}
        #pragma ghs section rodata=".vectors"
    #endif
const RESET_VECTOR __vector_table
#endif
= {
    (void *)(RAM_START_ADDRESS + SIZE_OF_RAM - 4),                       // stack pointer to top of RAM
    (void (*)(void))START_CODE,                                          // start address
};


// Flash configuration - this is linked at address 0x00000400
//
#if defined _COMPILE_IAR
__root const KINETIS_FLASH_CONFIGURATION __flash_config @ ".f_config"    // __root forces the function to be linked in IAR project
#elif defined _GNU
const KINETIS_FLASH_CONFIGURATION __attribute__((section(".f_config"))) __flash_config
#elif defined _CODE_WARRIOR
#pragma define_section flash_cfg ".FCONFIG" ".FCONFIG" ".FCONFIG" far_abs R
static __declspec(flash_cfg) KINETIS_FLASH_CONFIGURATION __flash_config
#elif defined _COMPILE_KEIL
__attribute__((section("F_INIT"))) const KINETIS_FLASH_CONFIGURATION __flash_config
#else
    #if defined _COMPILE_GHS                                             // {4}
        #pragma ghs section rodata=".f_config"
    #endif
const KINETIS_FLASH_CONFIGURATION __flash_config
#endif
= {
    KINETIS_FLASH_CONFIGURATION_BACKDOOR_KEY,
    KINETIS_FLASH_CONFIGURATION_PROGRAM_PROTECTION,
    KINETIS_FLASH_CONFIGURATION_SECURITY,
    KINETIS_FLASH_CONFIGURATION_NONVOL_OPTION,
    KINETIS_FLASH_CONFIGURATION_EEPROM_PROT,
    KINETIS_FLASH_CONFIGURATION_DATAFLASH_PROT
};













#ifdef _WINDOWS
// The following routines are only for simulator compatibility

